# coding=utf-8
# @Time    : 2026/9/13 20:35
# @Software: PyCharm
# 纯数字ID列表，注释对应物品名称
id_list = [
    (15317, 99),  # 金牌令箭
    (22801, 99),  # 榴莲
    (20805, 99),  # 霸王别姬
    (21302, 99),  # 竹笋香菇鸡汤
    (29652, 99),  # 不知名字帖
    (29653, 99),  # 不知名画卷
    (29654, 99),  # 不知名器具
    (29656, 99),  # 不知名装饰
    (29657, 99),  # 不知名书册
    (29609, 99),  # 不知名饰品
    (30301, 99),  # 龙井茶
    (30302, 99),  # 碧螺春
    (33801, 99),  # 彩墨
    (33802, 99),  # 玉砚台
    (32301, 99),  # 七巧板
    (33304, 99),  # 夜明珠
    (38301, 99),  # 琼花露
    (38302, 99),  # 荷花蕊
    # (41601, 1),  # 破天剑法
    # (41605, 1),  # 无极剑法
    # (41606, 1),  # 无名剑法
    # (41607, 1),  # 浮华掠影剑
]
print()
for item_id, item_num in id_list:
    # 输出目标格式，末尾带逗号
    print(f'{{"m_templeteId":{item_id},"m_stack":{item_num},"modifyData":null,"IsNew":true,"IsForbidden":false}}',
          end=',')
print()
